Repository: AlmiroN-code/TuboCMS
Catalog: translations/security.*.xlf
Languages: ru

source: An authentication exception occurred.
ru: Произошла ошибка аутентификации.

source: Authentication credentials could not be found.
ru: Аутентификационные данные не найдены.

source: Authentication request could not be processed due to a system problem.
ru: Запрос аутентификации не может быть обработан из-за системной ошибки.

source: Invalid credentials.
ru: Неверные учётные данные.

source: Cookie has already been used by someone else.
ru: Ошибка безопасности. Пожалуйста, войдите снова.

source: Not privileged to request the resource.
ru: У вас нет прав для доступа к этому ресурсу.

source: Invalid CSRF token.
ru: Недействительный токен безопасности. Пожалуйста, попробуйте снова.

source: No authentication provider found to support the authentication token.
ru: Не найден провайдер аутентификации, поддерживающий токен аутентификации.

source: No session available, it either timed out or cookies are not enabled.
ru: Сессия недоступна. Пожалуйста, включите cookies и попробуйте снова.

source: No token could be found.
ru: Токен не найден.

source: Username could not be found.
ru: Пользователь не найден.

source: Account has expired.
ru: Срок действия вашего аккаунта истёк.

source: Credentials have expired.
ru: Срок действия ваших учётных данных истёк.

source: Account is disabled.
ru: Ваш аккаунт отключён.

source: Account is locked.
ru: Ваш аккаунт заблокирован.

source: Too many failed login attempts, please try again later.
ru: Слишком много неудачных попыток входа, попробуйте позже.

source: Invalid or expired login link.
ru: Ссылка для входа недействительна или просрочена.

source: Too many failed login attempts, please try again in %minutes% minute.
ru: Слишком много неудачных попыток входа, повторите попытку через %minutes% минуту.

source: Too many failed login attempts, please try again in %minutes% minutes.
ru: Слишком много неудачных попыток входа, повторите попытку через %minutes% минуту.|Слишком много неудачных попыток входа, повторите попытку через %minutes% минуты.|Слишком много неудачных попыток входа, повторите попытку через %minutes% минут.

source: Bad credentials.
ru: Неверный email или пароль.

source: Full authentication is required to access this resource.
ru: Для доступа к этому ресурсу необходимо войти в систему.

source: Session has expired or is invalid.
ru: Ваша сессия истекла. Пожалуйста, войдите снова.

source: Password reset link has expired.
ru: Ссылка для сброса пароля истекла.

source: Invalid password reset token.
ru: Недействительный токен сброса пароля.

source: This email is already registered.
ru: Этот email уже зарегистрирован.

source: This username is already taken.
ru: Это имя пользователя уже занято.

source: Too many login attempts.
ru: Слишком много попыток входа. Попробуйте позже.

source: Too many registration attempts.
ru: Слишком много попыток регистрации. Попробуйте позже.

source: Access Denied.
ru: Доступ запрещён.

source: You are not allowed to access this page.
ru: У вас нет доступа к этой странице.
