Repository: AlmiroN-code/TuboCMS
Catalog: translations/validators.*.xlf
Languages: ru

source: video.title.not_blank
ru: Введите название видео

source: video.title.max_length
ru: Название не может быть длиннее {{ limit }} символов

source: video.file.invalid_type
ru: Загрузите корректный видео файл

source: video.file.too_large
ru: Видео файл слишком большой. Максимальный размер {{ limit }}

source: profile.avatar.invalid_type
ru: Загрузите изображение (JPEG, PNG, GIF, WebP)

source: profile.avatar.too_large
ru: Файл аватара слишком большой. Максимальный размер {{ limit }}

source: profile.cover.invalid_type
ru: Загрузите изображение (JPEG, PNG, GIF, WebP)

source: profile.cover.too_large
ru: Обложка слишком большая. Максимальный размер {{ limit }}

source: profile.bio.max_length
ru: Описание не может быть длиннее {{ limit }} символов

source: comment.not_blank
ru: Комментарий не может быть пустым

source: comment.max_length
ru: Комментарий слишком длинный
