Repository: AlmiroN-code/TuboCMS
Catalog: translations/validators.*.xlf
Languages: ru

source: This value should be false.
ru: Значение должно быть ложным.

source: This value should be true.
ru: Значение должно быть истинным.

source: This value should be of type {{ type }}.
ru: Тип значения должен быть {{ type }}.

source: This value should be blank.
ru: Значение должно быть пустым.

source: The value you selected is not a valid choice.
ru: Выбранное Вами значение недопустимо.

source: You must select at least {{ limit }} choice.|You must select at least {{ limit }} choices.
ru: Вы должны выбрать хотя бы {{ limit }} вариант.|Вы должны выбрать хотя бы {{ limit }} варианта.|Вы должны выбрать хотя бы {{ limit }} вариантов.

source: You must select at most {{ limit }} choice.|You must select at most {{ limit }} choices.
ru: Вы должны выбрать не более чем {{ limit }} вариант.|Вы должны выбрать не более чем {{ limit }} варианта.|Вы должны выбрать не более чем {{ limit }} вариантов.

source: One or more of the given values is invalid.
ru: Одно или несколько заданных значений недопустимо.

source: This field was not expected.
ru: Это поле не ожидалось.

source: This field is missing.
ru: Это поле отсутствует.

source: This value is not a valid date.
ru: Значение не является правильной датой.

source: This value is not a valid datetime.
ru: Значение даты и времени недопустимо.

source: This value is not a valid email address.
ru: Это значение не является корректным email адресом.

source: The file could not be found.
ru: Файл не может быть найден.

source: The file is not readable.
ru: Файл не может быть прочитан.

source: The file is too large ({{ size }} {{ suffix }}). Allowed maximum size is {{ limit }} {{ suffix }}.
ru: Файл слишком большой ({{ size }} {{ suffix }}). Максимальный размер {{ limit }} {{ suffix }}.

source: The mime type of the file is invalid ({{ type }}). Allowed mime types are {{ types }}.
ru: Недопустимый тип файла ({{ type }}). Разрешённые типы: {{ types }}.

source: This value should be {{ limit }} or less.
ru: Значение должно быть {{ limit }} или меньше.

source: This value is too long. It should have {{ limit }} character or less.|This value is too long. It should have {{ limit }} characters or less.
ru: Значение слишком длинное. Максимум {{ limit }} символ.|Значение слишком длинное. Максимум {{ limit }} символа.|Значение слишком длинное. Максимум {{ limit }} символов.

source: This value should be {{ limit }} or more.
ru: Значение должно быть {{ limit }} или больше.

source: This value is too short. It should have {{ limit }} character or more.|This value is too short. It should have {{ limit }} characters or more.
ru: Значение слишком короткое. Минимум {{ limit }} символ.|Значение слишком короткое. Минимум {{ limit }} символа.|Значение слишком короткое. Минимум {{ limit }} символов.

source: This value should not be blank.
ru: Это поле не может быть пустым.

source: This value should not be null.
ru: Значение не должно быть null.

source: This value should be null.
ru: Значение должно быть null.

source: This value is not valid.
ru: Это значение недопустимо.

source: This value is not a valid time.
ru: Значение времени недопустимо.

source: This value is not a valid URL.
ru: Значение не является допустимым URL.

source: The two values should be equal.
ru: Значения должны совпадать.

source: The file is too large. Allowed maximum size is {{ limit }} {{ suffix }}.
ru: Файл слишком большой. Максимально допустимый размер {{ limit }} {{ suffix }}.

source: The file is too large.
ru: Файл слишком большой.

source: The file could not be uploaded.
ru: Не удалось загрузить файл.

source: This value should be a valid number.
ru: Значение должно быть числом.

source: This file is not a valid image.
ru: Файл не является допустимым форматом изображения.

source: This is not a valid IP address.
ru: Это значение не является действительным IP-адресом.

source: This value is not a valid language.
ru: Значение не является допустимым языком.

source: This value is not a valid locale.
ru: Значение не является допустимой локалью.

source: This value is not a valid country.
ru: Значение не является допустимой страной.

source: This value is already used.
ru: Это значение уже используется.

source: The size of the image could not be detected.
ru: Не удалось определить размер изображения.

source: The image width is too big ({{ width }}px). Allowed maximum width is {{ max_width }}px.
ru: Ширина изображения слишком велика ({{ width }}px). Максимально допустимая ширина {{ max_width }}px.

source: The image width is too small ({{ width }}px). Minimum width expected is {{ min_width }}px.
ru: Ширина изображения слишком мала ({{ width }}px). Минимально допустимая ширина {{ min_width }}px.

source: The image height is too big ({{ height }}px). Allowed maximum height is {{ max_height }}px.
ru: Высота изображения слишком велика ({{ height }}px). Максимально допустимая высота {{ max_height }}px.

source: The image height is too small ({{ height }}px). Minimum height expected is {{ min_height }}px.
ru: Высота изображения слишком мала ({{ height }}px). Минимально допустимая высота {{ min_height }}px.

source: This value should be the user's current password.
ru: Значение должно быть текущим паролем пользователя.

source: This value should have exactly {{ limit }} character.|This value should have exactly {{ limit }} characters.
ru: Значение должно быть равно {{ limit }} символу.|Значение должно быть равно {{ limit }} символам.|Значение должно быть равно {{ limit }} символам.

source: The file was only partially uploaded.
ru: Файл был загружен только частично.

source: No file was uploaded.
ru: Файл не был загружен.

source: No temporary folder was configured in php.ini.
ru: В php.ini не была настроена временная папка, или настроенная папка не существует.

source: Cannot write temporary file to disk.
ru: Невозможно записать временный файл на диск.

source: A PHP extension caused the upload to fail.
ru: Расширение PHP вызвало ошибку при загрузке.

source: This collection should contain {{ limit }} element or more.|This collection should contain {{ limit }} elements or more.
ru: Эта коллекция должна содержать {{ limit }} элемент или больше.|Эта коллекция должна содержать {{ limit }} элемента или больше.|Эта коллекция должна содержать {{ limit }} элементов или больше.

source: This collection should contain {{ limit }} element or less.|This collection should contain {{ limit }} elements or less.
ru: Эта коллекция должна содержать {{ limit }} элемент или меньше.|Эта коллекция должна содержать {{ limit }} элемента или меньше.|Эта коллекция должна содержать {{ limit }} элементов или меньше.

source: This collection should contain exactly {{ limit }} element.|This collection should contain exactly {{ limit }} elements.
ru: Эта коллекция должна содержать ровно {{ limit }} элемент.|Эта коллекция должна содержать ровно {{ limit }} элемента.|Эта коллекция должна содержать ровно {{ limit }} элементов.

source: Invalid card number.
ru: Неверный номер карты.

source: Unsupported card type or invalid card number.
ru: Неподдерживаемый тип или неверный номер карты.

source: This is not a valid International Bank Account Number (IBAN).
ru: Это значение не является действительным Международным банковским счетом (IBAN).

source: This value is not a valid ISBN-10.
ru: Значение имеет неверный формат ISBN-10.

source: This value is not a valid ISBN-13.
ru: Значение имеет неверный формат ISBN-13.

source: This value is neither a valid ISBN-10 nor a valid ISBN-13.
ru: Значение не соответствует форматам ISBN-10 и ISBN-13.

source: This value is not a valid ISSN.
ru: Значение не соответствует формату ISSN.

source: This value is not a valid currency.
ru: Некорректный формат валюты.

source: This value should be equal to {{ compared_value }}.
ru: Значение должно быть равно {{ compared_value }}.

source: This value should be greater than {{ compared_value }}.
ru: Значение должно быть больше {{ compared_value }}.

source: This value should be greater than or equal to {{ compared_value }}.
ru: Значение должно быть больше или равно {{ compared_value }}.

source: This value should be identical to {{ compared_value_type }} {{ compared_value }}.
ru: Значение должно быть идентичным {{ compared_value_type }} {{ compared_value }}.

source: This value should be less than {{ compared_value }}.
ru: Значение должно быть меньше {{ compared_value }}.

source: This value should be less than or equal to {{ compared_value }}.
ru: Значение должно быть меньше или равно {{ compared_value }}.

source: This value should not be equal to {{ compared_value }}.
ru: Значение не должно быть равно {{ compared_value }}.

source: This value should not be identical to {{ compared_value_type }} {{ compared_value }}.
ru: Значение не должно быть идентичным {{ compared_value_type }} {{ compared_value }}.

source: The image ratio is too big ({{ ratio }}). Allowed maximum ratio is {{ max_ratio }}.
ru: Соотношение сторон изображения слишком велико ({{ ratio }}). Максимальное соотношение сторон {{ max_ratio }}.

source: The image ratio is too small ({{ ratio }}). Minimum ratio expected is {{ min_ratio }}.
ru: Соотношение сторон изображения слишком мало ({{ ratio }}). Минимальное соотношение сторон {{ min_ratio }}.

source: The image is square ({{ width }}x{{ height }}px). Square images are not allowed.
ru: Изображение квадратное ({{ width }}x{{ height }}px). Квадратные изображения не разрешены.

source: The image is landscape oriented ({{ width }}x{{ height }}px). Landscape oriented images are not allowed.
ru: Изображение в альбомной ориентации ({{ width }}x{{ height }}px). Изображения в альбомной ориентации не разрешены.

source: The image is portrait oriented ({{ width }}x{{ height }}px). Portrait oriented images are not allowed.
ru: Изображение в портретной ориентации ({{ width }}x{{ height }}px). Изображения в портретной ориентации не разрешены.

source: An empty file is not allowed.
ru: Пустой файл не допускается.

source: The host could not be resolved.
ru: Имя хоста не может быть разрешено.

source: This value does not match the expected {{ charset }} charset.
ru: Значение не совпадает с ожидаемой {{ charset }} кодировкой.

source: This is not a valid Business Identifier Code (BIC).
ru: Это значение не является действительным Бизнес-идентификатором (BIC).

source: Error
ru: Ошибка

source: This is not a valid UUID.
ru: Это значение не является действительным UUID.

source: This value should be a multiple of {{ compared_value }}.
ru: Значение должно быть кратно {{ compared_value }}.

source: This Business Identifier Code (BIC) is not associated with IBAN {{ iban }}.
ru: Данный BIC не связан с IBAN {{ iban }}.

source: This value should be valid JSON.
ru: Значение должно быть корректным JSON.

source: This collection should contain only unique elements.
ru: Эта коллекция должна содержать только уникальные элементы.

source: This value should be positive.
ru: Значение должно быть положительным.

source: This value should be either positive or zero.
ru: Значение должно быть положительным или равным нулю.

source: This value should be negative.
ru: Значение должно быть отрицательным.

source: This value should be either negative or zero.
ru: Значение должно быть отрицательным или равным нулю.

source: This value is not a valid timezone.
ru: Значение не является корректным часовым поясом.

source: This password has been leaked in a data breach, it must not be used. Please use another password.
ru: Данный пароль был скомпрометирован в результате утечки данных и не должен быть использован. Пожалуйста, используйте другой пароль.

source: This value should be between {{ min }} and {{ max }}.
ru: Значение должно быть между {{ min }} и {{ max }}.

source: This value is not a valid hostname.
ru: Значение не является корректным именем хоста.

source: The number of elements in this collection should be a multiple of {{ compared_value }}.
ru: Количество элементов в этой коллекции должно быть кратным {{ compared_value }}.

source: This value should satisfy at least one of the following constraints:
ru: Значение должно удовлетворять как минимум одному из следующих ограничений:

source: Each element of this collection should satisfy its own set of constraints.
ru: Каждый элемент этой коллекции должен удовлетворять своему собственному набору ограничений.

source: This value is not a valid International Securities Identification Number (ISIN).
ru: Значение не является корректным международным идентификационным номером ценных бумаг (ISIN).

source: This value should be a valid expression.
ru: Это значение должно быть корректным выражением.

source: This value is not a valid CSS color.
ru: Значение не является корректным CSS цветом.

source: This value is not a valid CIDR notation.
ru: Значение не соответствует нотации CIDR.

source: The value of the netmask should be between {{ min }} and {{ max }}.
ru: Значение маски подсети должно быть от {{ min }} до {{ max }}.

source: The filename is too long. It should have {{ filename_max_length }} character or less.|The filename is too long. It should have {{ filename_max_length }} characters or less.
ru: Имя файла слишком длинное. Оно должно содержать {{ filename_max_length }} символ или меньше.|Имя файла слишком длинное. Оно должно содержать {{ filename_max_length }} символа или меньше.|Имя файла слишком длинное. Оно должно содержать {{ filename_max_length }} символов или меньше.

source: The password strength is too low. Please use a stronger password.
ru: Слишком низкая надёжность пароля. Пожалуйста, используйте более надёжный пароль.

source: This value contains characters that are not allowed by the current restriction-level.
ru: Значение содержит символы, запрещённые на текущем уровне ограничений.

source: Using invisible characters is not allowed.
ru: Использование невидимых символов запрещено.

source: Mixing numbers from different scripts is not allowed.
ru: Смешивание номеров из разных сценариев запрещено.

source: Using hidden overlay characters is not allowed.
ru: Использование невидимых символов наложения запрещено.

source: The extension of the file is invalid ({{ extension }}). Allowed extensions are {{ extensions }}.
ru: Недопустимое расширение файла ({{ extension }}). Разрешенные расширения: {{ extensions }}.

source: The detected character encoding is invalid ({{ detected }}). Allowed encodings are {{ encodings }}.
ru: Обнаруженная кодировка символов недопустима ({{ detected }}). Разрешенные кодировки: {{ encodings }}.

source: This value is not a valid MAC address.
ru: Это значение не является действительным MAC-адресом.

source: This URL is missing a top-level domain.
ru: В этом URL отсутствует домен верхнего уровня.

source: This value is too short. It should contain at least one word.|This value is too short. It should contain at least {{ min }} words.
ru: Это значение слишком короткое. Оно должно содержать как минимум одно слово.|Это значение слишком короткое. Оно должно содержать как минимум {{ min }} слова.|Это значение слишком короткое. Оно должно содержать как минимум {{ min }} слов.

source: This value is too long. It should contain one word.|This value is too long. It should contain {{ max }} words or less.
ru: Это значение слишком длинное. Оно должно содержать только одно слово.|Это значение слишком длинное. Оно должно содержать {{ max }} слова или меньше.|Это значение слишком длинное. Оно должно содержать {{ max }} слов или меньше.

source: This value does not represent a valid week in the ISO 8601 format.
ru: Это значение не представляет допустимую неделю в формате ISO 8601.

source: This value is not a valid week.
ru: Это значение не является допустимой неделей.

# This value should not be before week &quot;{{ min }}&quot;.
source: This value should not be before week "{{ min }}".
ru: Это значение не должно быть раньше недели "{{ min }}".

# This value should not be after week &quot;{{ max }}&quot;.
source: This value should not be after week "{{ max }}".
ru: Это значение не должно быть после недели "{{ max }}".

source: This value is not a valid Twig template.
ru: Это значение не является корректным шаблоном Twig.

source: This file is not a valid video.
ru: Этот файл не является корректным видео.

source: The size of the video could not be detected.
ru: Не удалось определить размер видео.

source: The video width is too big ({{ width }}px). Allowed maximum width is {{ max_width }}px.
ru: Ширина видео слишком велика ({{ width }}px). Максимально допустимая ширина {{ max_width }}px.

source: The video width is too small ({{ width }}px). Minimum width expected is {{ min_width }}px.
ru: Ширина видео слишком мала ({{ width }}px). Минимально допустимая ширина {{ min_width }}px.

source: The video height is too big ({{ height }}px). Allowed maximum height is {{ max_height }}px.
ru: Высота видео слишком велика ({{ height }}px). Максимально допустимая высота {{ max_height }}px.

source: The video height is too small ({{ height }}px). Minimum height expected is {{ min_height }}px.
ru: Высота видео слишком мала ({{ height }}px). Минимально допустимая высота {{ min_height }}px.

source: The video has too few pixels ({{ pixels }} pixels). Minimum amount expected is {{ min_pixels }} pixels.
ru: В видео слишком мало пикселей ({{ pixels }} пикселей). Минимально допустимое количество {{ min_pixels }} пикселей.

source: The video has too many pixels ({{ pixels }} pixels). Maximum amount expected is {{ max_pixels }} pixels.
ru: В видео слишком много пикселей ({{ pixels }} пикселей). Максимально допустимое количество {{ max_pixels }} пикселей.

source: The video ratio is too big ({{ ratio }}). Allowed maximum ratio is {{ max_ratio }}.
ru: Соотношение сторон видео слишком велико ({{ ratio }}). Максимально допустимое соотношение {{ max_ratio }}.

source: The video ratio is too small ({{ ratio }}). Minimum ratio expected is {{ min_ratio }}.
ru: Соотношение сторон видео слишком мало ({{ ratio }}). Минимально допустимое соотношение {{ min_ratio }}.

source: The video is square ({{ width }}x{{ height }}px). Square videos are not allowed.
ru: Видео квадратное ({{ width }}x{{ height }}px). Квадратные видео не разрешены.

source: The video is landscape oriented ({{ width }}x{{ height }}px). Landscape oriented videos are not allowed.
ru: Видео в альбомной ориентации ({{ width }}x{{ height }}px). Видео в альбомной ориентации не разрешены.

source: The video is portrait oriented ({{ width }}x{{ height }}px). Portrait oriented videos are not allowed.
ru: Видео в портретной ориентации ({{ width }}x{{ height }}px). Видео в портретной ориентации не разрешены.

source: The video file is corrupted.
ru: Видеофайл повреждён.

source: The video contains multiple streams. Only one stream is allowed.
ru: Видео содержит несколько потоков. Разрешён только один поток.

# Unsupported video codec &quot;{{ codec }}&quot;.
source: Unsupported video codec "{{ codec }}".
ru: Неподдерживаемый видеокодек «{{ codec }}».

# Unsupported video container &quot;{{ container }}&quot;.
source: Unsupported video container "{{ container }}".
ru: Неподдерживаемый видеоконтейнер «{{ container }}».

source: The image file is corrupted.
ru: Файл изображения повреждён.

source: The image has too few pixels ({{ pixels }} pixels). Minimum amount expected is {{ min_pixels }} pixels.
ru: В изображении слишком мало пикселей ({{ pixels }} пикселей). Минимально допустимое количество {{ min_pixels }} пикселей.

source: The image has too many pixels ({{ pixels }} pixels). Maximum amount expected is {{ max_pixels }} pixels.
ru: В изображении слишком много пикселей ({{ pixels }} пикселей). Максимально допустимое количество {{ max_pixels }} пикселей.

source: This filename does not match the expected charset.
ru: Это имя файла не соответствует ожидаемой кодировке.

source: This form should not contain extra fields.
ru: Эта форма не должна содержать дополнительных полей.

source: The uploaded file was too large. Please try to upload a smaller file.
ru: Загруженный файл слишком большой. Пожалуйста, попробуйте загрузить файл меньшего размера.

source: The CSRF token is invalid. Please try to resubmit the form.
ru: CSRF значение недопустимо. Пожалуйста, попробуйте повторить отправку формы.

source: This value is not a valid HTML5 color.
ru: Значение не является допустимым HTML5 цветом.

source: Please enter a valid birthdate.
ru: Пожалуйста, введите действительную дату рождения.

source: The selected choice is invalid.
ru: Выбранный вариант недопустим.

source: The collection is invalid.
ru: Коллекция недопустима.

source: Please select a valid color.
ru: Пожалуйста, выберите допустимый цвет.

source: Please select a valid country.
ru: Пожалуйста, выберите действительную страну.

source: Please select a valid currency.
ru: Пожалуйста, выберите действительную валюту.

source: Please choose a valid date interval.
ru: Пожалуйста, выберите действительный период.

source: Please enter a valid date and time.
ru: Пожалуйста, введите действительные дату и время.

source: Please enter a valid date.
ru: Пожалуйста, введите действительную дату.

source: Please select a valid file.
ru: Пожалуйста, выберите допустимый файл.

source: The hidden field is invalid.
ru: Значение скрытого поля недопустимо.

source: Please enter an integer.
ru: Пожалуйста, введите целое число.

source: Please select a valid language.
ru: Пожалуйста, выберите допустимый язык.

source: Please select a valid locale.
ru: Пожалуйста, выберите допустимую локаль.

source: Please enter a valid money amount.
ru: Пожалуйста, введите допустимое количество денег.

source: Please enter a number.
ru: Пожалуйста, введите номер.

source: The password is invalid.
ru: Пароль недействителен.

source: Please enter a percentage value.
ru: Пожалуйста, введите процентное значение.

source: The values do not match.
ru: Значения не совпадают.

source: Please enter a valid time.
ru: Пожалуйста, введите действительное время.

source: Please select a valid timezone.
ru: Пожалуйста, выберите действительный часовой пояс.

source: Please enter a valid URL.
ru: Пожалуйста, введите действительный URL.

source: Please enter a valid search term.
ru: Пожалуйста, введите действительный поисковый запрос.

source: Please provide a valid phone number.
ru: Пожалуйста, введите действительный номер телефона.

source: The checkbox has an invalid value.
ru: Флажок имеет недопустимое значение.

source: Please enter a valid email address.
ru: Пожалуйста, введите допустимый email адрес.

source: Please select a valid option.
ru: Пожалуйста, выберите допустимый вариант.

source: Please select a valid range.
ru: Пожалуйста, выберите допустимый диапазон.

source: Please enter a valid week.
ru: Пожалуйста, введите действительную неделю.

source: username.not_blank
ru: Введите имя пользователя

source: username.min_length
ru: Имя пользователя должно содержать минимум {{ limit }} символа

source: username.max_length
ru: Имя пользователя не может быть длиннее {{ limit }} символов

source: username.invalid_characters
ru: Имя пользователя может содержать только буквы, цифры, дефисы и подчеркивания

source: username.already_used
ru: Это имя пользователя уже занято

source: email.not_blank
ru: Введите email адрес

source: email.invalid
ru: Введите корректный email адрес

source: email.max_length
ru: Email не может быть длиннее {{ limit }} символов

source: email.already_used
ru: Аккаунт с таким email уже существует

source: password.not_blank
ru: Введите пароль

source: password.min_length
ru: Пароль должен содержать минимум {{ limit }} символов

source: password.max_length
ru: Пароль не может быть длиннее {{ limit }} символов

source: password.weak
ru: Пароль должен содержать минимум одну строчную букву, одну заглавную букву и одну цифру

source: password.compromised
ru: Этот пароль был скомпрометирован в утечках данных. Выберите другой пароль.

source: password.mismatch
ru: Пароли должны совпадать
